InformationRegisters/ЗвонкиСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСделки</Name>
			<Comment>Звонки и сделки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСделки/Ext/ManagerModule.bsl
Функция Добавить(Сигнатура, Дата, Номер, Ссылка, Наименование) Экспорт
	Рез = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Дата) = Тип("Дата");
	Доступно = Доступно И ТипЗнч(Номер) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Наименование) = Тип("Строка");
	Если Не Доступно Тогда
		Возврат Рез;
	КонецЕсли;
	
	Зап = РегистрыСведений.ЗвонкиСделки.СоздатьМенеджерЗаписи();
	Зап.Сигнатура = Сигнатура;
	Зап.Прочитать();
	
	Если Зап.Выбран() Тогда
		Возврат Рез;
	КонецЕсли;
	
	Зап.Сигнатура 	 = Сигнатура;
	Зап.Дата 	 	 = Дата;
	Зап.Номер 		 = Номер;
	Зап.Ссылка		 = Ссылка;
	Зап.Наименование = Наименование;
	
	Попытка 
		Зап.Записать();
	Исключение
		Данные = "Сигнатура = "+Сигнатура+"; Дата = "+Дата+"; Номер = "+Номер+"; Наименование = "+Наименование;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗвонкиСделки, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки;
	
	Рез = Истина;
КонецФункции
